Lesson 1
https://nbviewer.jupyter.org/urls/bitbucket.org/hrojas/learn-pandas/raw/master/lessons/01%20-%20Lesson.ipynb

In [ ]:

# importing the libraries needed
import pandas as pd
import matplotlib.pyplot as plt
import sys
from pandas import read_csv, DataFrame

create a data set to use

In [ ]:
names= ['bob','jessica','mary','john','mel']
births = [966,155,77,578,973]

In [53]:
# we can use the zip function to merge the two list

In [ ]:
dataset = list(zip(names, births))
dataset

In [ ]:
# We now will use the pandas library to export this data set into a data frame, df
df = pd.DataFrame(data=dataset, columns=['name','births'])
df

In [9]:
# Export the dataframe to a csv file using to_csv function, file will be saved in the same area as notebook except otherwise specified
df.to_csv('/Users/uczhn/Documents/AZURE_DATA_SCIENCE_PYTHON/Data/births.csv', index = False, header= False)

In [10]:
df.to_csv('/Users/uczhn/Documents/AZURE_DATA_SCIENCE_PYTHON/Data/births1.csv')

Import data

In [58]:
#check docstring of read_csv function
#read_csv?

In [ ]:
# file can be read in as in two ways 
# 1
df1 = pd. read_csv('/Users/uczhn/Documents/AZURE_DATA_SCIENCE_PYTHON/Data/births.csv')
#or we dan define the path if the path is very long
location = r'/Users/uczhn/Documents/AZURE_DATA_SCIENCE_PYTHON/Data/births.csv'
df2 = pd.read_csv(location)

In [ ]:
# the column names are not imported
print(df2)

In [13]:
# to ensure the colums names are imported, you must speficify it using the names arguments
df3 = pd.read_csv(location, names=['name','birth'])

In [14]:
df3

      name  birth
0      bob    966
1  jessica    155
2     mary     77
3     john    578
4      mel    973

Prepare data

In [63]:
# we need to check each colums if the data is of the right format
# we can check whole data frame or columns wise
df3.dtypes

name     object
birth     int64
dtype: object

In [64]:
#colum wise
df3.name.dtypes

dtype('O')

In [65]:
#column wise
df3.birth.dtypes

dtype('int64')

Analyze data

In [66]:
# find the birth name that occures the most, ie max
df3['birth'].max()

973

In [67]:
# find the birth name that occurs the least, ie min
df3['birth'].min()

77

In [15]:
# data can be sorted accoring to a specified column
Sorted_data = df3.sort_values(['birth'], ascending = False)

In [69]:
# after sorting the data, the top value, ie max can be viewed using the head function
Sorted_data. head(1)

  name  birth
4  mel    973

In [70]:
# max could be found as follows. this will return true or false
[df3['birth']==df3['birth'].max()]

[0    False
 1    False
 2    False
 3    False
 4     True
 Name: birth, dtype: bool]

In [71]:
#this will select the name of the person with max value
df3['name'][df3['birth'] == df3['birth'].max()]

4    mel
Name: name, dtype: object

In [16]:
# Name associated with the maximum value
MaxName = df3['name'][df3['birth'] == df3['birth'].max()].values

In [17]:
MaxName

array(['mel'], dtype=object)

Lesson 2

In [18]:
# these steps just create another data set consiting of 1,000 baby names and the number of births recorded for that year (1880
names = ['Bob','Jessica','Mary','John','Mel']

In [19]:
from numpy import random

In [20]:
random.seed(500)

In [22]:
random_names = [names[random.randint(low=0,high=len(names))] for i in range(1000)]
random_names

['Bob',
 'John',
 'Mary',
 'Mel',
 'John',
 'John',
 'Jessica',
 'Bob',
 'John',
 'Jessica',
 'Mel',
 'Mel',
 'Jessica',
 'Mary',
 'John',
 'Mel',
 'Mary',
 'Mary',
 'Jessica',
 'Mel',
 'Bob',
 'Jessica',
 'Bob',
 'Mary',
 'Mel',
 'Jessica',
 'John',
 'Mary',
 'Mel',
 'Mel',
 'Mary',
 'John',
 'Jessica',
 'Jessica',
 'Mary',
 'Mary',
 'John',
 'Jessica',
 'Mary',
 'John',
 'Mel',
 'Mel',
 'Jessica',
 'Mel',
 'John',
 'Mary',
 'Mel',
 'Mel',
 'Bob',
 'Jessica',
 'Mel',
 'Mary',
 'Mary',
 'Bob',
 'Mel',
 'Mel',
 'John',
 'Mary',
 'Jessica',
 'Mary',
 'Mel',
 'Mary',
 'Mary',
 'Mary',
 'Mary',
 'John',
 'Mary',
 'Mel',
 'Mel',
 'Jessica',
 'Mary',
 'Mary',
 'Bob',
 'Mel',
 'Mel',
 'Mel',
 'Bob',
 'Bob',
 'John',
 'Mary',
 'Mel',
 'Bob',
 'Bob',
 'Jessica',
 'Bob',
 'Bob',
 'John',
 'Mel',
 'Bob',
 'Bob',
 'Mel',
 'Jessica',
 'Jessica',
 'Bob',
 'Mary',
 'John',
 'John',
 'Mel',
 'John',
 'Mary',
 'John',
 'Mel',
 'John',
 'Jessica',
 'Jessica',
 'Mel',
 'Jessica',
 'Mel',
 'Bob',
 'Jessica',
 'Bob',
 'Mary',
 'Mel',
 'Jessica',
 'Mary',
 'Mel',
 'Mary',
 'John',
 'Mary',
 'Jessica',
 'Jessica',
 'Mel',
 'Mel',
 'Jessica',
 'Bob',
 'Bob',
 'John',
 'Mary',
 'John',
 'Bob',
 'Mary',
 'Mel',
 'Mary',
 'Bob',
 'Mary',
 'Mary',
 'John',
 'Bob',
 'Mel',
 'Bob',
 'Mel',
 'Mary',
 'Jessica',
 'Jessica',
 'Bob',
 'Bob',
 'Mel',
 'Mary',
 'Mary',
 'Mary',
 'Mary',
 'Mary',
 'Mary',
 'John',
 'Jessica',
 'Mel',
 'Mary',
 'Mary',
 'Mel',
 'Bob',
 'John',
 'Mary',
 'Bob',
 'Bob',
 'Mel',
 'Jessica',
 'John',
 'Mary',
 'Mary',
 'Jessica',
 'John',
 'Jessica',
 'John',
 'Mary',
 'Mel',
 'Jessica',
 'Bob',
 'Mel',
 'Jessica',
 'John',
 'Jessica',
 'Bob',
 'Mary',
 'Mary',
 'John',
 'Mel',
 'Mary',
 'Jessica',
 'Jessica',
 'Mary',
 'John',
 'Mary',
 'Mel',
 'Jessica',
 'Mel',
 'Mary',
 'Bob',
 'Mary',
 'Mary',
 'Bob',
 'Mary',
 'Jessica',
 'John',
 'Mary',
 'Bob',
 'Mary',
 'John',
 'Bob',
 'John',
 'Mary',
 'John',
 'Mel',
 'Mary',
 'Mary',
 'John',
 'John',
 'Jessica',
 'John',
 'Bob',
 'Bob',
 'John',
 'Bob',
 'Mary',
 'Mel',
 'John',
 'Mel',
 'Jessica',
 'Jessica',
 'Bob',
 'John',
 'Jessica',
 'John',
 'Mary',
 'Mel',
 'Mel',
 'Mel',
 'Jessica',
 'Mary',
 'Mary',
 'Jessica',
 'Bob',
 'Bob',
 'Jessica',
 'Mary',
 'Jessica',
 'Jessica',
 'Mary',
 'Bob',
 'Jessica',
 'Bob',
 'John',
 'Mary',
 'John',
 'Mel',
 'Mel',
 'John',
 'John',
 'Mel',
 'Mel',
 'John',
 'Bob',
 'Mary',
 'John',
 'Jessica',
 'Bob',
 'Mel',
 'Bob',
 'Jessica',
 'Mary',
 'John',
 'John',
 'John',
 'Jessica',
 'Mel',
 'Jessica',
 'Jessica',
 'Mel',
 'Jessica',
 'John',
 'Mary',
 'Jessica',
 'John',
 'Jessica',
 'Jessica',
 'Mel',
 'Mary',
 'Bob',
 'Mel',
 'Mel',
 'John',
 'Mary',
 'Bob',
 'Bob',
 'Jessica',
 'Jessica',
 'Mel',
 'John',
 'John',
 'Mel',
 'Jessica',
 'John',
 'Mary',
 'Jessica',
 'Bob',
 'Jessica',
 'Mary',
 'Jessica',
 'Jessica',
 'Bob',
 'John',
 'Bob',
 'Mel',
 'Mel',
 'John',
 'John',
 'Bob',
 'John',
 'Mary',
 'Mary',
 'Jessica',
 'Mary',
 'Mel',
 'John',
 'Mary',
 'Mary',
 'Mel',
 'Jessica',
 'Bob',
 'Mary',
 'Mary',
 'Mary',
 'Mary',
 'Jessica',
 'Bob',
 'Mel',
 'Jessica',
 'Mary',
 'Bob',
 'Mel',
 'Mel',
 'Mel',
 'John',
 'Mary',
 'Bob',
 'Mary',
 'Mel',
 'John',
 'Bob',
 'Mel',
 'Mary',
 'Mary',
 'Mel',
 'John',
 'Jessica',
 'Jessica',
 'Mary',
 'Bob',
 'Mary',
 'Bob',
 'Mel',
 'Mel',
 'Mary',
 'Mary',
 'Jessica',
 'Bob',
 'Jessica',
 'Jessica',
 'Mary',
 'Bob',
 'John',
 'John',
 'Jessica',
 'Jessica',
 'Mel',
 'Bob',
 'Mel',
 'John',
 'Bob',
 'Jessica',
 'Jessica',
 'Jessica',
 'John',
 'Jessica',
 'Mel',
 'John',
 'Mary',
 'Mel',
 'Mary',
 'Bob',
 'Mary',
 'Jessica',
 'Jessica',
 'Mel',
 'Mary',
 'John',
 'Jessica',
 'Jessica',
 'John',
 'Jessica',
 'Mel',
 'Bob',
 'Jessica',
 'John',
 'Bob',
 'Mel',
 'John',
 'Mel',
 'Mel',
 'Mary',
 'Mary',
 'Jessica',
 'Mel',
 'Mel',
 'Mel',
 'Mel',
 'Mel',
 'Mary',
 'Bob',
 'Mel',
 'John',
 'Mary',
 'John',
 'John',
 'Jessica',
 'John',
 'Jessica',
 'Bob',
 'Mary',
 'Jessica',
 'Jessica',
 'John',
 'Jessica',
 'Mary',
 'Mel',
 'Bob',
 'Bob',
 'Bob',
 'Jessica',
 'Bob',
 'Mary',
 'Bob',
 'Mary',
 'Jessica',
 'Mary',
 'Mel',
 'Mel',
 'Mary',
 'John',
 'Mel',
 'Bob',
 'Jessica',
 'John',
 'Mel',
 'Jessica',
 'Mary',
 'Jessica',
 'Mel',
 'Jessica',
 'Jessica',
 'Mary',
 'Jessica',
 'John',
 'Mary',
 'Bob',
 'Jessica',
 'Mel',
 'John',
 'Mel',
 'Mel',
 'Mary',
 'Bob',
 'Mel',
 'Mel',
 'Mary',
 'John',
 'Mary',
 'Jessica',
 'Mary',
 'Mary',
 'Mel',
 'Mary',
 'John',
 'Mel',
 'Bob',
 'Bob',
 'Mel',
 'Mary',
 'Mary',
 'Mel',
 'Jessica',
 'Mel',
 'Mary',
 'John',
 'Bob',
 'Mel',
 'Mel',
 'John',
 'Bob',
 'Bob',
 'John',
 'Mary',
 'Jessica',
 'Jessica',
 'Mary',
 'John',
 'Mary',
 'John',
 'Mel',
 'Mel',
 'Bob',
 'John',
 'Mary',
 'Mel',
 'John',
 'Mary',
 'Mel',
 'Bob',
 'Mary',
 'Bob',
 'Bob',
 'Jessica',
 'Jessica',
 'John',
 'Mel',
 'Bob',
 'Jessica',
 'Bob',
 'Bob',
 'Mary',
 'Mel',
 'John',
 'John',
 'Mary',
 'Mel',
 'Mary',
 'Bob',
 'Bob',
 'John',
 'Mary',
 'Mel',
 'Jessica',
 'Bob',
 'Mel',
 'John',
 'Jessica',
 'Mary',
 'Mary',
 'Mary',
 'Mary',
 'Mel',
 'Jessica',
 'Mary',
 'John',
 'Mel',
 'Jessica',
 'Bob',
 'Jessica',
 'Mel',
 'Jessica',
 'Jessica',
 'John',
 'Mel',
 'Mel',
 'Bob',
 'Mary',
 'John',
 'Jessica',
 'Bob',
 'Mary',
 'Bob',
 'Mary',
 'Mary',
 'John',
 'Mel',
 'John',
 'Mel',
 'Bob',
 'Bob',
 'Bob',
 'John',
 'Mary',
 'Mary',
 'John',
 'Bob',
 'Bob',
 'John',
 'Mary',
 'Bob',
 'Mel',
 'Bob',
 'John',
 'Bob',
 'Jessica',
 'Mary',
 'Bob',
 'Mary',
 'John',
 'Bob',
 'Jessica',
 'Bob',
 'Bob',
 'Bob',
 'Mel',
 'Jessica',
 'Mel',
 'Jessica',
 'Jessica',
 'Mary',
 'John',
 'Jessica',
 'Mel',
 'John',
 'Mary',
 'Mary',
 'Jessica',
 'Mary',
 'Mel',
 'John',
 'Bob',
 'Mel',
 'John',
 'Jessica',
 'Bob',
 'John',
 'John',
 'Bob',
 'Jessica',
 'Jessica',
 'Mel',
 'Bob',
 'Mary',
 'Jessica',
 'Mel',
 'Jessica',
 'John',
 'Mel',
 'John',
 'John',
 'Mary',
 'Mel',
 'Bob',
 'John',
 'Jessica',
 'Mary',
 'Mary',
 'Jessica',
 'John',
 'Jessica',
 'Mary',
 'Mel',
 'Bob',
 'Jessica',
 'Mel',
 'Mel',
 'Jessica',
 'Mary',
 'Jessica',
 'Jessica',
 'Bob',
 'Mel',
 'Bob',
 'Bob',
 'John',
 'Mary',
 'John',
 'Jessica',
 'Bob',
 'Mel',
 'Mel',
 'Mel',
 'Jessica',
 'Mel',
 'Jessica',
 'John',
 'John',
 'John',
 'Jessica',
 'Mel',
 'John',
 'Mary',
 'Mary',
 'Bob',
 'Bob',
 'Mel',
 'Jessica',
 'Jessica',
 'John',
 'Mel',
 'Mary',
 'Mary',
 'Jessica',
 'Mel',
 'Jessica',
 'Bob',
 'Jessica',
 'Jessica',
 'Mary',
 'Mary',
 'Mary',
 'Bob',
 'Mary',
 'Mel',
 'John',
 'Bob',
 'John',
 'John',
 'Mel',
 'Mary',
 'Jessica',
 'Mel',
 'Mel',
 'Bob',
 'Mel',
 'John',
 'Bob',
 'Mary',
 'Mel',
 'Mary',
 'John',
 'John',
 'John',
 'John',
 'Bob',
 'Mel',
 'Bob',
 'John',
 'Jessica',
 'Mary',
 'Mary',
 'Bob',
 'Mel',
 'John',
 'Bob',
 'John',
 'Bob',
 'Jessica',
 'Jessica',
 'John',
 'Jessica',
 'Mel',
 'Mel',
 'Bob',
 'Mary',
 'Bob',
 'Mary',
 'Mel',
 'Mary',
 'Jessica',
 'Bob',
 'Bob',
 'Bob',
 'Bob',
 'Bob',
 'Bob',
 'Mary',
 'Jessica',
 'Mel',
 'Jessica',
 'John',
 'Mel',
 'John',
 'John',
 'Mary',
 'Mel',
 'Jessica',
 'John',
 'Mel',
 'Jessica',
 'Jessica',
 'Bob',
 'Mary',
 'Mel',
 'Mary',
 'Mel',
 'Jessica',
 'Mel',
 'Bob',
 'Mary',
 'Mel',
 'Bob',
 'Jessica',
 'Mary',
 'Mel',
 'Mary',
 'Mary',
 'Bob',
 'Mel',
 'Bob',
 'Mary',
 'Bob',
 'Jessica',
 'John',
 'Bob',
 'Jessica',
 'John',
 'Mary',
 'Jessica',
 'John',
 'Bob',
 'Bob',
 'Mary',
 'John',
 'Mel',
 'Bob',
 'Mel',
 'Mel',
 'John',
 'Mel',
 'John',
 'Mary',
 'Bob',
 'Mel',
 'Mary',
 'Jessica',
 'John',
 'Mary',
 'Mary',
 'Jessica',
 'Bob',
 'Jessica',
 'Mel',
 'Mel',
 'Mel',
 'Mary',
 'Jessica',
 'Mary',
 'Bob',
 'Mel',
 'Bob',
 'Bob',
 'Bob',
 'Mary',
 'John',
 'Mary',
 'John',
 'Jessica',
 'Jessica',
 'John',
 'Jessica',
 'Jessica',
 'Bob',
 'Mary',
 'John',
 'Mary',
 'Bob',
 'Jessica',
 'Bob',
 'Bob',
 'Mel',
 'Bob',
 'Bob',
 'Mary',
 'Jessica',
 'Bob',
 'Jessica',
 'Mel',
 'John',
 'Jessica',
 'Jessica',
 'Jessica',
 'Bob',
 'John',
 'Mel',
 'John',
 'Jessica',
 'Jessica',
 'Mary',
 'John',
 'John',
 'Bob',
 'Mel',
 'John',
 'Mel',
 'Mary',
 'Mel',
 'Jessica',
 'Bob',
 'John',
 'John',
 'Bob',
 'Jessica',
 'John',
 'John',
 'Bob',
 'Mel',
 'Mel',
 'Mel',
 'Mary',
 'Mary',
 'Mary',
 'Mel',
 'Mel',
 'John',
 'Mary',
 'Jessica',
 'Mary',
 'Jessica',
 'Mel',
 'Jessica',
 'Jessica',
 'Jessica',
 'Bob',
 'Mary',
 'Mary',
 'Bob',
 'Bob',
 'Mel',
 'John',
 'Mary',
 'Bob',
 'Mel',
 'Mary',
 'Mary',
 'Mary',
 'Jessica',
 'Mary',
 'Bob',
 'Mary',
 'Mary',
 'Jessica',
 'Mel',
 'Mary',
 'Jessica',
 'Bob',
 'Jessica',
 'Mary',
 'Mel',
 'Bob',
 'Mel',
 'John',
 'Jessica',
 'Jessica',
 'Mary',
 'Mel',
 'John',
 'Bob',
 'Jessica',
 'Jessica',
 'Mel',
 'John',
 'Mel',
 'Mary',
 'Bob',
 'John',
 'Mel',
 'Jessica',
 'Mel',
 'Bob',
 'Bob',
 'Mel',
 'Bob',
 'Jessica',
 'Jessica',
 'Bob',
 'Jessica',
 'Jessica',
 'Bob',
 'John',
 'Mel',
 'Mary',
 'Mary',
 'Bob',
 'Mary',
 'Mel',
 'John',
 'Mary',
 'Mel',
 'Jessica',
 'Jessica',
 'Bob',
 'John',
 'Mary',
 'Mary',
 'Mel',
 'Mary',
 'Mel',
 'Mel',
 'Mary',
 'Mel',
 'Jessica',
 'Jessica',
 'John',
 'Jessica',
 'Mary',
 'Mary',
 'John',
 'Bob',
 'Bob',
 'John',
 'John',
 'Bob',
 'Mel',
 'Mel',
 'John',
 'John',
 'John',
 'Mel',
 'Mary',
 'Mary',
 'Jessica']

In [25]:
births = [random.randint(low=0,high=1000) for i in range(1000)]

In [80]:
BabyDataSet = list(zip(random_names,births) )

In [81]:
df = pd.DataFrame(data = BabyDataSet, columns=['Names', 'Births'])

In [82]:
# this looks at the content of the df , first 10 rows
df[:10]

     Names  Births
0     Mary     968
1  Jessica     155
2  Jessica      77
3      Bob     578
4  Jessica     973
5  Jessica     124
6  Jessica     155
7     Mary     403
8     Mary     199
9     Mary     191

# check directory

In [28]:
import os

In [29]:
os.getcwd()

'/Users/uczhn/Documents/AZURE_DATA_SCIENCE_PYTHON'

Unique values

In [31]:
# we can use unique property of the dataframe to find all the unique records
df['name'].unique()

array(['bob', 'jessica', 'mary', 'john', 'mel'], dtype=object)

# we can actually print the unique values like so

In [92]:
for x in df['name'].unique():
   print(x)

Mary
Jessica
Bob
John
Mel

# we can drop duplicate values using the drop_duplicate() function

In [93]:

df_unique = df.drop_duplicates()

Describe

# Value_counts()

Aggregrate data using groupby function

Lesson 3

In [33]:
# Import libraries
import pandas as pd
import matplotlib.pyplot as plt
import numpy.random as np
import sys
import matplotlib

In [34]:
# We will be creating our own test data for analysis
# set seed
np.seed(111)

# Function to generate test data
def CreateDataSet(Number=1):
    
    Output = []
    
    for i in range(Number):
        
        # Create a weekly (mondays) date range
        rng = pd.date_range(start='1/1/2009', end='12/31/2012', freq='W-MON')
        
        # Create random data
        data = np.randint(low=25,high=1000,size=len(rng))
        
        # Status pool
        status = [1,2,3]
        
        # Make a random list of statuses
        random_status = [status[np.randint(low=0,high=len(status))] for i in range(len(rng))]
        
        # State pool
        states = ['GA','FL','fl','NY','NJ','TX']
        
        # Make a random list of states 
        random_states = [states[np.randint(low=0,high=len(states))] for i in range(len(rng))]
    
        Output.extend(zip(random_states, random_status, data, rng))
        
    return Output

In [35]:
# we can  now use the function above to create a dataset
dataset = CreateDataSet(4)
df = pd.DataFrame(data=dataset, columns=['State','Status','CustomerCount','StatusDate'])
#df.info()

Write and read the data set

Learn direct: https://www.learndatasci.com/tutorials/python-pandas-tutorial-complete-introduction-for-beginners/

# Handling duplicates

In [ ]:
# always good to check you aren't aggregating duplicate rows.
# use drop_duplicates() to get rid of duplicate information and returns a new df, this function takes arguments like keep, last etc
# new_df = m_df.drop_duplicates()

Renaming columns with more suitable names

In [ ]:
# check colums names
m_df.columns

In [ ]:
# we can rename some columns names
m_df.rename(columns={'Runtime (Minutes)':'Runtime', 'Revenue (Millions)':'Revenue'}, inplace = True)

In [ ]:
# the columns names can be changed from upper to lower cases like so
m_df.columns = ['rank', 'genre', 'description', 'director', 'actors', 'year', 'runtime', 
                     'rating', 'votes', 'revenue_millions', 'metascore']

In [ ]:
# a more sensible way to change to lower case would be  like so
m_df.columns = [col.upper() for col in m_df]

In [ ]:
m_df.columns = [col.lower() for col in m_df]

# How to work with missing values

In [ ]:
# this checks which cell in data frame has null values
m_df.isnull()

In [ ]:
# this checks which column in data frame has null values an d returns a DF
m_df.isnull()

In [ ]:
# to count which the number of nulls in each columns
m_df.isnull().sum()

In [ ]:
# to drop missing values, use this, this will return a new DF without altering the original one
m_df.dropna()

 # we can drop just colunms with missing values by just setting the axis =1

In [ ]:

m_df.dropna(axis=1)

# Imputation

In [ ]:
# this calculates the mean of non missing values in the column
m_df['Revenue (Millions)'].mean()

In [ ]:
#this calculates the mean values for that colummn and replace the missing values with the mean
m_df.fillna(m_df['Revenue (Millions)'].mean())

# inplace = True,

In [ ]:
# the original dF is not affected, but if we use inplace = True, the original dF will be affected

In [ ]:
#this calculates the mean values for that colummn and replace the missing values with the mean
m_df.fillna(m_df['Revenue (Millions)'].mean(), inplace = True)

In [ ]:
m_df.isnull().sum()

The imputation can be made more granular by calculating the mean of say Gender and  replacing it with that for males or females only

Describe

In [ ]:
#describe gives a summary statistics for each continuous variable in the data fram
m_df.describe()

In [ ]:
# the statisticics can be exported to a df like so
data = m_df.describe()

In [ ]:
# describe can also be used on categorical variables to produce counts of rows, unique count of category, top category and its frequency
m_df['Genre'].describe()

In [ ]:
# value count produces a count of each cartegory in the columns
m_df['Genre']. value_counts()

# DataFrame slicing, selecting, extracting

In [ ]:
m_df

In [ ]:
# we can extrtact just a column and check its status
genre_col = m_df['Genre']

In [ ]:
# check attributes of the columns
type(genre_col)

In [ ]:
# to extract the colums as a df, you need to pass the colums names
genre_col = m_df[['Genre']] # N.B double square brackets

In [ ]:
genre_col

In [ ]:
# we can select as many colums as we like
subset = m_df[['Genre', 'Rank']]

In [ ]:
subset.head()

# Extracting rows only


# use .loc if rows are indexed by names
# use .iloc if rows are index by numbers

In [ ]:
prom = m_df.loc['Sing']

In [ ]:
# if the rows were indexed using numbers, then use
# prom = m_df.iloc[1]  # 1 for the first row
# NB when slicing using index, the object at the end of the index is not included

In [ ]:
# for multiple rows
prom = m_df.loc['Sing': 'Passengers']

In [ ]:
prom

# Conditional selections

To do that, we take a column from the DataFrame and apply a Boolean condition to it

In [ ]:
# show only films by Ridley Scott or films with a rating greater than or equal to 8.0
ridley_df = (m_df['Director'] == "Ridley Scott")  # this returns a series of true for films directed and false for films not directed

In [ ]:
ridley_df

In [ ]:
# To return the rows where that condition is True we have to pass this operation into the DataFrame:
ridley_df = m_df[m_df['Director'] == "Ridley Scott"]

In [ ]:
ridley_df

In [ ]:
# conditional selections using numerical values
ridley_df1 =  m_df[m_df['Rating'] >=8.6]

In [ ]:
ridley_df1

In [ ]:
# conditions using logical operators | for "or" and & for "and

ridley_df2 = m_df[(m_df['Director'] == "Ridley Scott") & (m_df['Rating'] <8.6)] # group evaluations with parentheses

In [ ]:
ridley_df2

# Applying functions

In [ ]:
# create a function that returns good after a certain threshold, otherwise returns bad

def rating_fnc(x):
  if x > 8.0:
    return "good"
  else:
    return "bad"

In [ ]:
# this creates a colums, Rating_cat in the data set with either good of bad

m_df["Rating_cat"] = m_df["Rating"].apply(rating_fnc)

In [ ]:
m_df

In [ ]:
# the lamda function achieves the same result
m_df["Rating_cat1"] = m_df["Rating"].apply(lambda x: 'GOOD' if x > 8.0 else 'BAD')

In [ ]:
m_df

Lesson 3 continuation

In [1]:
import pandas as pd
location = r'C:\Users\Elenor\Lesson3.xlsx'
df = pd.read_excel(location, 0, index_col='StatusDate')

In [2]:
df.dtypes

State            object
Status            int64
CustomerCount     int64
dtype: object

In [11]:
# this checks the index and the columns
df.columns

Index(['State', 'Status', 'CustomerCount'], dtype='object')

In [4]:
df

           State  Status  CustomerCount
StatusDate
2009-01-05    GA       1            877
2009-01-12    FL       1            901
2009-01-19    fl       3            749
2009-01-26    FL       3            111
2009-02-02    GA       1            300
2009-02-09    FL       2            706
2009-02-16    TX       3            347
2009-02-23    fl       2            143
2009-03-02    FL       3            833
2009-03-09    NY       1            992
2009-03-16    fl       2            978
2009-03-23    TX       2             32
2009-03-30    GA       2            293
2009-04-06    fl       1            291
2009-04-13    fl       3            474
2009-04-20    NJ       2            905
2009-04-27    NJ       1            753
2009-05-04    GA       3            309
2009-05-11    fl       2            295
2009-05-18    NY       3            443
2009-05-25    TX       1             46
2009-06-01    GA       3            591
2009-06-08    FL       2            737
2009-06-15    NJ       3             62
2009-06-22    GA       3            997
2009-06-29    GA       3            767
2009-07-06    fl       1            723
2009-07-13    fl       2            293
2009-07-20    FL       1            710
2009-07-27    NJ       1            990
...          ...     ...            ...
2012-06-11    FL       3            100
2012-06-18    fl       1            669
2012-06-25    fl       2            348
2012-07-02    fl       3            336
2012-07-09    NJ       3            393
2012-07-16    FL       3            210
2012-07-23    FL       3            363
2012-07-30    fl       3            995
2012-08-06    TX       1            178
2012-08-13    NJ       3             26
2012-08-20    TX       1            248
2012-08-27    NY       2             74
2012-09-03    FL       3             46
2012-09-10    fl       3            920
2012-09-17    NJ       2            623
2012-09-24    TX       3            784
2012-10-01    fl       3            924
2012-10-08    fl       1            716
2012-10-15    fl       3            428
2012-10-22    NJ       1            955
2012-10-29    GA       2            380
2012-11-05    fl       2            105
2012-11-12    NJ       3            772
2012-11-19    FL       2            390
2012-11-26    FL       3            513
2012-12-03    NY       2            122
2012-12-10    TX       2            887
2012-12-17    TX       2            988
2012-12-24    GA       3            946
2012-12-31    FL       2            970

[836 rows x 3 columns]


Prepare Data

In [6]:
# changing names to upper cases for all records in state
df['State'] = df.State.apply(lambda x: x.upper())

In [14]:
# for al observations in the state columns that is == NJ, replace ity with T
df.State[df.State=='T']= 'NJ'

C:\Users\Elenor\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

Lesson 4

In [37]:
# Import libraries
import pandas as pd
import sys

In [38]:
d = [0,1,2,3,4,5,6,7,8,9]

In [40]:
d_f = pd.DataFrame(d)
d_f

   0
0  0
1  1
2  2
3  3
4  4
5  5
6  6
7  7
8  8
9  9

In [41]:
d_f.columns= ['rev']

In [42]:
# we can add a columns
d_f['newcol'] = 5
d_f

   rev  newcol
0    0       5
1    1       5
2    2       5
3    3       5
4    4       5
5    5       5
6    6       5
7    7       5
8    8       5
9    9       5

In [44]:
d_f['newname'] = 'harry'
d_f

   rev  newcol newname
0    0       5   harry
1    1       5   harry
2    2       5   harry
3    3       5   harry
4    4       5   harry
5    5       5   harry
6    6       5   harry
7    7       5   harry
8    8       5   harry
9    9       5   harry

In [45]:
# we cn modify the new column
d_f['newcol']= d_f['newcol'] + 1

In [46]:
d_f

   rev  newcol newname
0    0       6   harry
1    1       6   harry
2    2       6   harry
3    3       6   harry
4    4       6   harry
5    5       6   harry
6    6       6   harry
7    7       6   harry
8    8       6   harry
9    9       6   harry

In [47]:
# we can del a columns
del d_f['newname']

In [48]:
# we can create new columss
d_f['test'] = 3

In [49]:
d_f['col']= d_f['rev']

In [50]:
d_f

   rev  newcol  test  col
0    0       6     3    0
1    1       6     3    1
2    2       6     3    2
3    3       6     3    3
4    4       6     3    4
5    5       6     3    5
6    6       6     3    6
7    7       6     3    7
8    8       6     3    8
9    9       6     3    9

In [51]:
# If we wanted, we could change the name of the index
i = ['a','b','c','d','e','f','g','h','i','j']
d_f.index = i
d_f

   rev  newcol  test  col
a    0       6     3    0
b    1       6     3    1
c    2       6     3    2
d    3       6     3    3
e    4       6     3    4
f    5       6     3    5
g    6       6     3    6
h    7       6     3    7
i    8       6     3    8
j    9       6     3    9

In [52]:
# using loc to select pieces of data, recal loc is for letter index
d_f.loc['a':'d']

   rev  newcol  test  col
a    0       6     3    0
b    1       6     3    1
c    2       6     3    2
d    3       6     3    3

In [53]:
# ising iloc for intergers
d_f[0:3] # recal that the last interger is not included

   rev  newcol  test  col
a    0       6     3    0
b    1       6     3    1
c    2       6     3    2

In [54]:
# selecting columns
d_f[['test', 'col']]

   test  col
a     3    0
b     3    1
c     3    2
d     3    3
e     3    4
f     3    5
g     3    6
h     3    7
i     3    8
j     3    9

# conditional selection using rows and columns

In [51]:
d_f.loc[d_f.index[0:3],'rev']

a    0
b    1
c    2
Name: rev, dtype: int64

In [49]:
d_f

   rev  newcol  test  col
a    0       6     3    0
b    1       6     3    1
c    2       6     3    2
d    3       6     3    3
e    4       6     3    4
f    5       6     3    5
g    6       6     3    6
h    7       6     3    7
i    8       6     3    8
j    9       6     3    9

In [52]:
# we can select from index 5 and above
d_f.loc[d_f.index[5:],'col']

f    5
g    6
h    7
i    8
j    9
Name: col, dtype: int64

In [54]:
d_f.loc[d_f.index[5:],['col', 'test']] # multiple colunms has to be in square brackets

   col  test
f    5     3
g    6     3
h    7     3
i    8     3
j    9     3